{
  "name": "Bruno Assis Carvalho",
  "position": "Fullstack developer",
  "socialMedia": [
    {
      "name": "linkedin",
      "url": "https://www.linkedin.com/in/bruno-assis-carvalho-044095a2/"
    },
    {
      "name": "github",
      "url": "https://github.com/brunoassiscarvalho"
    }
  ],
  "aboutMe": "A passionate about programming and Java developer who learn and turned into a Javascript programmer, and Typescript knowledgeable, curious and creative. For me first things first, learn and undertand the buiseness, then creating solutions that delight the customer.",
  "education": [
    {
      "date":{"start":"01/2003", "end":"07/2008"},
      "course": "Bachelor of Business Administration with Specialization in Management Information Systems",
      "institution": "IESRIVER Instituo de Ensino Superior de Rio Verde"
    },
    {
      "date":{"start":"01/2016", "end":"07/2017"},
      "course": "Postgraduate in Mobile Device Development",
      "institution": "Universitary Center IESB"
    },
    {
      "date":{"start":"01/2022", "end":"07/2023"},
      "course": "Postgraduate in Mobile Device Development",
      "institution": "Universitary Center IESB"
    }
  ],
  "certifications": [
    "Oracle Certified Associate, Java SE 8 Programmer (OCAJP/SCJA)",
    "Cambridge Linguaskill Certification - Level B1",
    "Investment Certification - ANBIMA CPA10"
  ],
  "experience": [
    {
      "date":{"start":"08/2010", "end":"currently"},
      "company": "Bank of Brazil (Banco do Brasil S.A)",
      "posisiton": "Fullstack developer",
      "jobs": [
        "Java development with Weblogic, Struts 2",
        "System migration to AngularJS and API Rest",
        "Low code framework development. Our team developed a framework in ReactJS, Node and MongoDB to do react-native screens, for our mobile app"
      ],
      "detail": "I worked with customer service from 2010 to 2013, in an agency. Then, after an internal process, I was recruited to the Technology Department where I worked as a web developer for the company customer self-service system, using Java, Javascript, CSS, HTML, Git and Maven, Weblogic technologies. Performed requirements gathering and application development. I participated in the migration of the system from the Struts framework to AngularJS, as well as the development of several features for the system. I developed on a low-code project, in which we develop a tool for building mobile applications using ReactJS, React-Native, NodeJS and MongoDB. Now I lead a team that develops a functionality, in React-Native for mobile app, in the bank's insurance sector."
    },
    {
      "date":{"start":"09/2021", "end":"currently"},
      "company": "Totem",
      "posisiton": "Freelancer Fullstack JEE Developer",
      "jobs": [
        "Fullstack developer in Java with JSF, and Oracle SQL data-base"
      ],
      "detail": "I work in web development in JPA applications, using Hibernate, JSF, Java 8 and Oracle database. Acting from assistance in requirements gathering, construction of the project architecture and development."
    },
    {
      "date":{"start":"01/2021", "end":"09/2021"},
      "company": "Curriculum Seguro",
      "posisiton": "Freelancer Fullstack Javascript Developer",
      "jobs": [
        "Fullstack developer in Javascript with Typescript, NodeJS, ReactJS and MongoDB"
      ],
      "detail":"I carried out alone the construction of a system for registering professional resumes and managing them, the project being composed of two distinct subsystems, one aimed at professionals looking for new opportunities and another aimed at employees of Curriculum Seguro, to manage the resumes. . The system was developed using the MERN stack (Mongo, Express, React, Node), in which I could exercise and learn about various aspects of software development, from understanding the business, gathering requirements, prototyping screens, developing interface, API construction, configuration of the production environment, deployment and follow-up."
    }
  ],
  "knowledge": [
    {
      "technology": "Javascript",
      "detail": "Ecma6 with Typescript"
    },
    {
      "technology": "React",
      "detail": "ReactJS e React Native with Typescript and Hooks"
    },
    {
      "technology": "MongoDB",
      "detail": "Queries, agregation, index, schemas with types validationsusing mongoose"
    },
    {
      "technology": "NodeJS",
      "detail": "Using Express.JS and NodeJS to create API Rest with knowledge of Token JWT and concepts of security, validation and authentication of transactions as well as logging and creation of deployment pipeline on Heroku"
    },
    {
      "technology": "Java",
      "detail": "Maven, Weblogic for creation of JEE applications using JSF or Struts, and deploy on Weblogic servers"
    },
    {
      "technology": "HTML",
      "detail": "Knowledge in building HTML pages with styling in CSS, SASS"
    },
    {
      "technology": "Agile methods",
      "detail": "Participating in agile teams using Scrum and Kambam, sometimes I replaced the Scrum Master"
    },
    {
      "technology": "Atomic Design",
      "detail": "Use of component libraries such as Material UI, Native Base and Bootstrap, for encapsulation and construction of components using the concepts of Atomic Design"
    },
    {
      "technology": "Design Thinking, Design Sprint",
      "detail": "I know business understanding methodologies as well as screen prototyping in the MarvelApp tool"
    }
  ],
  "extra": [
    {
      "technology": "Game Devlopment",
      "detail": "Unity 3D, Blender, C#. Game creation, knowledge in: textures, materials, modelagem, rigging, ragdoll, coding with C# in Unity 3D"
    }
  ]
}